app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-11-16 23:53:30.433268"], ["updated_at", "2019-11-16 23:53:30.433268"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 7], ["created_at", "2019-11-16 23:53:30.434332"], ["updated_at", "2019-11-16 23:53:30.434332"]]
---
  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      Song.create(title: song[0], artist_name: song[1])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @song = Song.find(params[:id])